; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v13)
             (pred_5 ?v7 ?v5)
             (pred_7 ?v4 ?v5)
             (pred_2 ?v8 ?v4 )
	     (pred_9 ?v4)
             (pred_8 ?v2)
             (pred_11 ?v7)
             (pred_6 ?v5)
             (pred_10 ?v4)
             (pred_4 ?v7)
             (pred_1 ?v4)
             (pred_12 ))



(:action op_3
:parameters (?v12 ?v9 ?v11 ?v3)
:precondition (and (pred_8 ?v12) (pred_8 ?v9) (pred_11 ?v11) (pred_6 ?v3)
          (pred_3 ?v12 ?v9) (pred_5 ?v11 ?v3)
                   (pred_7 ?v9 ?v3) (pred_9 ?v12) 
                   (pred_10 ?v9) (pred_4 ?v11))
:effect (and  (pred_1 ?v9) (not (pred_10 ?v9))))


(:action op_4
:parameters (?v12 ?v10)
:precondition (and (pred_8 ?v12) (pred_8 ?v10)
               (pred_9 ?v12) (pred_3 ?v12 ?v10) (pred_1 ?v10))
:effect (and (pred_9 ?v10) (not (pred_9 ?v12))))

(:action op_1
:parameters (?v12 ?v11)
:precondition (and (pred_8 ?v12) (pred_11 ?v11) 
                  (pred_9 ?v12) (pred_2 ?v11 ?v12) (pred_12 ))
:effect (and (pred_4 ?v11)
   (not (pred_2 ?v11 ?v12)) (not (pred_12 ))))


(:action op_5
:parameters (?v12 ?v1 ?v6)
:precondition (and (pred_8 ?v12) (pred_11 ?v1) (pred_11 ?v6)
                  (pred_9 ?v12) (pred_4 ?v6) (pred_2 ?v1 ?v12))
:effect (and (pred_4 ?v1) (pred_2 ?v6 ?v12)
        (not (pred_4 ?v6)) (not (pred_2 ?v1 ?v12))))

(:action op_2
:parameters (?v12 ?v11)
:precondition (and (pred_8 ?v12) (pred_11 ?v11) 
                  (pred_9 ?v12) (pred_4 ?v11))
:effect (and (pred_12 ) (pred_2 ?v11 ?v12) (not (pred_4 ?v11)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_04 obj_08 obj_06 obj_02 obj_09 obj_10 obj_07 obj_12
    obj_13 obj_01
    obj_05 obj_03
    )

    (:init
       (pred_12)

       (pred_8 obj_11)
       (pred_8 obj_04)
       (pred_8 obj_08)
       (pred_8 obj_06)
       (pred_8 obj_02)
       (pred_8 obj_09)
       (pred_8 obj_10)
       (pred_8 obj_07)
       (pred_8 obj_12)
       (pred_6 obj_13)
       (pred_6 obj_01)
       (pred_11 obj_05)
       (pred_11 obj_03)

       (pred_3 obj_11 obj_06)
       (pred_3 obj_11 obj_04)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_11)
       (pred_3 obj_08 obj_09)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_06 obj_02)
       (pred_3 obj_06 obj_11)
       (pred_3 obj_02 obj_07)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_02 obj_06)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_09 obj_08)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_10 obj_07)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_07 obj_12)
       (pred_3 obj_07 obj_02)
       (pred_3 obj_07 obj_10)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_12 obj_07)
       (pred_10 obj_08)
       (pred_10 obj_12)
       (pred_7  obj_08 obj_13)
       (pred_7  obj_12 obj_01)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_1 obj_06)
       (pred_1 obj_02)
       (pred_1 obj_09)
       (pred_1 obj_10)
       (pred_1 obj_07)

       (pred_5  obj_05 obj_13)
       (pred_5  obj_03 obj_01)
       (pred_2 obj_05 obj_07)
       (pred_2 obj_03 obj_11)
       (pred_9 obj_10)
    )

    (:goal (and
       (pred_2 obj_05 obj_04)
    ))
(:constraints
  (always (not (pred_9 obj_02)))
)
)

; plan
1. (op_4 obj_10 obj_07)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_07)
   goals met: 0 of 1
2. (op_1 obj_07 obj_05)
   deleted: (pred_2 obj_05 obj_07) (pred_12)
   added: (pred_4 obj_05)
   goals met: 0 of 1
3. (op_4 obj_07 obj_10)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_10)
   goals met: 0 of 1
4. (op_4 obj_10 obj_06)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_06)
   goals met: 0 of 1
5. (op_4 obj_06 obj_11)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_11)
   goals met: 0 of 1
6. (op_4 obj_11 obj_04)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_04)
   goals met: 0 of 1
7. (op_2 obj_04 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_12) (pred_2 obj_05 obj_04)
   goals met: 1 of 1
